{
	"dadosreleases": [
            {
			"dados": [
				{
					"version": "Versão 1.3.5"
				},
				{
					"text": "- Correção de erro ao selecionar local ao iniciar o serviço."
				},
				{
					"text": "- Melhor destaque nos botões de navegação ao navegar entre as telas."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.3.4"
				},
				{
					"text": "- Agora é possível informar o local ao iniciar o ponto."
				},
				{
					"text": "- Alteração para transmissão dos dados independente do tipo de veículo/máquina."
				},
				{
					"text": "- Habilitado para iniciar serviço dos caminhões e veículos."
				},
				{
					"text": "- Ajustado os botões do tipo de solicitação (Serão exibidos em forma de lista horizontal)."
				},
				{
					"text": "- Melhoria no layout conforme a resolução da tela do dispositivo."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.3.3"
				},
				{
					"text": "- Correção na exibição do tempo do serviço, paradas e pausas."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.3.2"
				},
				{
					"text": "- Correções de erros ao atualizar os dados."
				},
				{
					"text": "- Bloqueado o login no app para usuários web."
				},
				{
					"text": "- Correções no login ao alterar o nome do usuário."
				},
				{
					"text": "- Correções ao exibir os serviços da máquina."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.3.1"
				},
				{
					"text": "- Agora é possível adicionar uma foto ao informar peso e número da nota no romaneio."
				},
				{
					"text": "- Habilitado Manutenção, Abastecimentos e Inspeção para os caminhões."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.3.0"
				},
				{
					"text": "- Correção de bugs na lista de inspeções realizadas."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.2.9"
				},
				{
					"text": "- Agora é possível adicionar uma foto do problema na inspeção do veículo/máquina."
				},
				{
					"text": "- Na lista de inspeções realizadas agora é possível adicionar uma foto do problema resolvido."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.2.8"
				},
				{
					"text": "- As pausas do ponto estão limitadas a: Almoço, Janta e Lanche."
				},
				{
					"text": "- Agora é obrigatório transmitir todos os dados antes de realizar logout ou limpar os dados do App."
				},
				{
					"text": "- Agora é possível escolher via parâmetro se os dados dos serviços e do ponto serão o não transmitidos automaticamente ao gravá-los."
				},
				{
					"text": "- Nesta versão é obrigatório relatar se for constatado algum problema na inspeção do veículo/máquina!"
				},
				{
					"text": "- Agora é possível consultar as inspeções offline, serão atualizadas junto aos dados!"
				},
				{
					"text": "- Adicionado texto com o plano de ação do problema na lista de inspeções. (Serão editados pelo gerencial!)."
				},
				{
					"text": "- Adicionado botão na lista de inspeções realizadas para o operador/motorista informar que foi realizado o reparo."
				},
				{
					"text": "- Caso o operador/motorista selecione folga/banco de horas ao iniciar o serviço será exibido por um tempo na tela e o serviço será encerrado automaticamente após este período."
				},
				{
					"text": "- Ajustes no ponto do Operador/Motorista, parametrizado se poderá ou não iniciar mais de uma folga/banco de horas no dia."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.2.7"
				},
				{
					"text": "- Correções no tamanho dos botões em geral."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.2.6"
				},
				{
					"text": "- Correções de bugs."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.2.5"
				},
				{
					"text": "- Adicionado o código da frota na lista de máquinas/veículos."
				},
				{
					"text": "- Adicionado na tela inicial texto com o local/fazenda que o serviço foi iniciado."
				},
				{
					"text": "- Agora a lista de inspeções realizadas mostrará somente as 30 anteriores."
				},
				{
					"text": "- As peças da manutenção aparecerão somente as disponíveis para aquela máquina/veículo."
				},
				{
					"text": "- Agora é possível apontar as manutenções da oficina."
				},
				{
					"text": "- Corrigido erro que duplicava o cadastro de peças."
				}
			]
		},
           {
			"dados": [
				{
					"version": "Versão 1.2.4"
				},
				{
					"text": "- Agora as paradas de máquina podem ser apontadas mais tarde, mas antes da finalização do serviço."
				}
			]
		},
           {
			"dados": [
				{
					"version": "Versão 1.2.3"
				},
				{
					"text": "- Correções de bugs."
				},
				{
					"text": "- Melhoria na captura de logs de erro."
				}
			]
		},
           {
			"dados": [
				{
					"version": "Versão 1.2.2"
				},
				{
					"text": "- Correções de bugs."
				}
			]
		},
           {
			"dados": [
				{
					"version": "Versão 1.2.1"
				},
				{
					"text": "- Ao realizar a inspeção da máquina agora é possível informar se está ok ou não ou se aquela inspeção não se aplica a máquina."
				},
				{
					"text": "- Alteração na listagem dos serviços ao informar a produção."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.2.0"
				},
				{
					"text": "- Agora os operadores podem realizar manutenções de alguns itens."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.1.9"
				},
				{
					"text": "- Atualização SDK 33."
				}
			]
		},
            {
			"dados": [
				{
					"version": "Versão 1.1.8"
				},
				{
					"text": "- Agora deve ser informado a situação antes de iniciar o ponto."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.1.7"
				},
				{
					"text": "- Corrigida exibição do tempo de serviço, paradas, deslocamentos e pausas quando for maior que 24 horas."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.1.6"
				},
				{
					"text": "- Agora o operador pode listar as inspeções realizadas para fim de auditoria."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.1.5"
				},
				{
					"text": "- Agora o operador pode informar as abastecidas da máquina."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.1.4"
				},
				{
					"text": "- Agora é possível adicionar pausas ao serviço do motorista/operador."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.1.3"
				},
				{
					"text": "- Bloqueio de login de usuários de ApoMaq Web."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.1.2"
				},
				{
					"text": "- Agora é possível o motorista informar o peso da carga e número da nota fiscal nos romaneios."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.1.1"
				},
				{
					"text": "- Correção de bug."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.1.0"
				},
				{
					"text": "- Melhoria de desempenho."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.0.9"
				},
				{
					"text": "- Corrigido erro ao selecionar Máquina/Veículo."
				},
				{
					"text": "- Melhorias de desempenho."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.0.8"
				},
				{
					"text": "- Corrigido erro ao alterar a máquina ou veículo."
				},
				{
					"text": "- Caso habilitado será transmitido automaticamente os dados da produção ao adicioná-la ou editá-la."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.0.7"
				},
				{
					"text": "- Corrigido erro ao abrir a câmera no Android versão 13."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.0.6"
				},
				{
					"text": "- Corrigido as permissões de câmera e fotos para Android versão 13."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.0.5"
				},
				{
					"text": "- Melhorias na atualização do aplicativo."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.0.4"
				},
				{
					"text": "- Corrigido travamento ao gravar uma solicitação ou despesa."
				},
				{
					"text": "- Corrigido ícone de status da internet."
				},
				{
					"text": "- Melhorias na transmissão das solicitações e despesas."
				},
				{
					"text": "- Habilitado a rotação da de tela ao utilizar a câmera."
				},
				{
					"text": "- Adicionado as fotos na lista de Solicitações."
				},
				{
					"text": "- Melhorias na transmissão das abastecidas.."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.0.3"
				},
				{
					"text": "- Melhorias de desempenho."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.0.2"
				},
				{
					"text": "- Parametrizado a obrigatoriedade de realizar toda a inspeção da máquina ou veículo."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.0.1"
				},
				{
					"text": "- O usuário será notificado a cada atualização do App disponível."
				}
			]
		},
		{
			"dados": [
				{
					"version": "Versão 1.0.0"
				},
				{
					"text": "- Versão de lançamento."
				}
			]
		}
	]
}